{
  "naif[0-9][0-9][0-9][0-9].tls": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE LSK file incorporating leapseconds up to TBD, created by NAIF, JPL."
    }],
  "pck[0-9][0-9][0-9][0-9][0-9].tpc": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE text PCK file containing constants from the IAU TDB report, created by NAIF, JPL."
    }],
  "insight_v[0-9][0-9].tf": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE FK file defining reference frames the INSIGHT lander, its structures, and science instruments, created by NAIF, JPL."
    }],
  "marcoa_v[0-9][0-9].tf": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE FK file defining reference frames the MARCO-A spacecraft, its structures, and instruments, and FOVs for its structures and instruments, created by NAIF, JPL."
    }],
  "marcob_v[0-9][0-9].tf": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE FK file defining reference frames the MARCO-B spacecraft, its structures, and instruments, and FOVs for its structures and instruments, created by NAIF, JPL."
    }],
  "insight_ant_v[0-9][0-9].ti": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE IK file providing FOV definitions and other instrument parameters for the INSIGHT antennas, created by NAIF, JPL."
    }],
  "insight_hp3_rad_v[0-9][0-9].ti": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE IK file providing FOV definitions for the INSIGHT Heat Flow and Physical Properties Package (HP3) Radiometer instrument, created by HP3 Team, DLR."
    }],
  "insight_icc_[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]_c[0-9][0-9].ti": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE IK file providing FOV definitions and other instrument parameters for the INSIGHT Instrument Context Camera (ICC) instrument, created by NAIF, JPL."
    }],
  "insight_idc_[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]_c[0-9][0-9].ti": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE IK file providing FOV definitions and other instrument parameters for the INSIGHT Instrument Deployment Camera (IDC) instrument, created by NAIF, JPL."
    }],
  "nsy_sclkscet_[0-9][0-9][0-9][0-9][0-9].tsc": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE SCLK file containing time correlation data for the main INSIGHT on-board clock, created by NAIF, JPL. The original name of this file was NSY_SCLKSCET.$VERSION.tsc.",
      "patterns": [{ "VERSION":"13->18"}]
    }],
  "insight_lmst_ops[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].tsc": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE SCLK file implementing INSIGHT Local Mean Solar Time (LMST), created by NAIF, JPL."
    }],
  "marcoa_fake_v[0-9][0-9].tsc": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE SCLK file containing fictitious MARCO-A clock correlation data required to access MARCO-A CKs, created by NAIF, JPL."
    }],
  "marcob_fake_v[0-9][0-9].tsc": [
    {
      "mklabel_options": "DEF_TIMES",
      "description": "SPICE SCLK file containing fictitious MARCO-B clock correlation data required to access MARCO-B CKs, created by NAIF, JPL."
    }],
  "de[0-9][0-9][0-9]s*.bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing JPL planetary ephemerides version $VER, created by the Solar System Dynamics group (SSD), JPL."
    }],
  "mar[0-9][0-9][0-9]s*.bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing JPL Martian satellite ephemerides version $VER, created by the Solar System Dynamics group (SSD), JPL."
    }],
  "insight_cru_.*_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing reconstructed INSIGHT cruise trajectory, created by the INSIGHT NAV Team, JPL."
    }],
  "insight_edl_.*_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing reconstructed INSIGHT Entry Descent Landing (EDL) trajectory, created by the INSIGHT EDL Team, LMCO."
    }],
  "insight_ls_ops[0-9][0-9][0-9][0-9][0-9][0-9]_iau2000_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing actual INSIGHT landing site location, created by NAIF, JPL."
    }],
  "insight_atls_ops[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing the INSIGHT lander (zero) offset with respect to the landing site, created by NAIF, JPL."
    }],
  "insight_struct_v[0-9][0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing relative locations of selected INSIGHT structures and science instruments, created by NAIF, JPL."
    }],
  "marcoa_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing reconstructed MARCO-A cruise trajectory, created by the MARCO NAV Team, JPL."
    }],
  "marcob_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing reconstructed MARCO-B cruise trajectory, created by the MARCO NAV Team, JPL."
    }],
  "insight_idc_rec_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bsp": [
    {
      "mklabel_options": "",
      "description": "SPICE SPK file containing deflected (gravity-compensated) position of the INSIGHT Instrument Deployment Camera (IDC), covering only IDC image times, created by NAIF, JPL."
    }],
  "insight_cru_rec_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9][0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed INSIGHT spacecraft cruise orientation, created by NAIF, JPL."
    }],
  "insight_edl_rec_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed INSIGHT spacecraft Entry Descent Landing (EDL) orientation, created the INSIGHT EDL Team, LMCO."
    }],
  "insight_surf_ops_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed INSIGHT spacecraft landed orientation, created by NAIF, JPL."
    }],
  "insight_cruise2lander_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing fixed rotation between the INSIGHT cruise and lander frames, covering cruise and EDL, created by NAIF, JPL."
    }],
  "insight_lander2cruise_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing fixed rotation between the INSIGHT lander and cruise frames, covering surface operations, created by NAIF, JPL."
    }],
  "marcoa_cru_rec_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9][0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed MARCO-A orientation, created by NAIF, JPL."
    }],
  "marcob_cru_rec_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9][0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed MARCO-B orientation, created by NAIF, JPL."
    }],
  "insight_ida_enc_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed orientation of the INSIGHT Instrument Deployment Arm (IDA), encoder-based, created by NAIF, JPL."
    }],
  "insight_ida_pot_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing reconstructed orientation of the INSIGHT Instrument Deployment Arm (IDA), potentiometer-based, created by NAIF, JPL."
    }],
  "insight_idc_enc_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing deflected (gravity-compensated) orientation of the INSIGHT Instrument Deployment Camera (IDC), covering only IDC image times, encoder-based, created by NAIF, JPL."
    }],
  "insight_idc_pot_[0-9][0-9][0-9][0-9][0-9][0-9]_[0-9][0-9][0-9][0-9][0-9][0-9]_v[0-9].bc": [
    {
      "mklabel_options": "",
      "description": "SPICE CK file containing deflected (gravity-compensated) orientation of the INSIGHT Instrument Deployment Camera (IDC), covering only IDC image times, potentiometer-based, created by NAIF, JPL."
    }],
  "insight_v[0-9][0-9].tm": [
    {
      "mklabel_options": "",
      "description": "SPICE MK file listing kernels for the whole mission and including CHRONOS setup parameters, created by NAIF, JPL."
    }]
}
